import React from "react";
import "./Career.css";

function Career() {
  return (
    <div className="career" id="career">
      <div className="career-tag">💼 Опыт работы</div>
      <div className="career-1">
        <div className="career-1-text">
          <img
            className="career-1-img"
            src="https://online-express.ru/themes/newTheme/img/onex-logo-ru.svg"
            alt="Описание изображения"
          ></img>
          <h3 className="career-1-h3">ООО "МЕГАПОЛЮС ГРУППА"</h3>
          <div>
            <b>Москва</b>
          </div>
          <br></br>
          <div>Ведущий инженер-тестировщик</div>
          <div>Апрель 2023 — По настоящее время (4 месяца)</div>
          <br></br>
          <br></br>

          <p>
            Работа в продуктовой команде из 20 человек
            (разработчики/аналитики/тестирование) Так как проект только
            развивается, но уже широко используется клиентами в ближайшее время
            должны увеличить штат до 40 человек.
          </p>
          <div>Мои обязанности:</div>
          <p>
            — Внедрение и разработка процессов тестирования с нуля в проекте,
            который существует более двух лет и развился до больших масштабов.
          </p>
          <p>— Ответственность за тестирование всех задач.</p>
          <p>— Создание структуры для увеличения штата до 5 тестировщиков</p>
          <p>
            — Написание документации и руководств для работы отдела
            тестирования.
          </p>
          <p>— Разработка и поддержка тест-кейсов в TestRail/Test IT.</p>
          <p>
            — Внедрение автоматизированного тестирования с использованием
            фреймворка Cypress, позволяющего повысить эффективность и скорость
            тестирования.
          </p>
          <p>
            — Внедрение и разработка тестирования API с использованием
            инструмента Postman, обеспечивающего полную проверку
            функциональности и стабильности API.
          </p>
          <p>
            — Проведение регрессионного и функционального тестирования,
            обеспечивающего высокое качество и надежность продукта перед каждым
            релизом.
          </p>
          <p>
            — Разработка и поддержка автоматизированных регрессионных тестов на
            Cypress, с целью ускорения процесса тестирования и обнаружения
            потенциальных проблем.
          </p>
          <p>
            — Тестирование БД с использованием Dbeaver (SELECT, JOIN, ORDER BY,
            ASC/DESC, LIMIT, OFFSET)
          </p>
          <p>
            — Заведение и отслеживание баг-репортов в системе управления
            задачами Redmine, с последующим участием в процессе их решения и
            верификации.
          </p>
          <p>
            — Участие в проведении собеседований и оценке потенциальных
            сотрудников для расширения команды тестирования.
          </p>
          <p>
            — Распределение задач команде тестирования и отслеживание их
            выполнение.
          </p>
          <p>— Отслеживание эффективности тестирования</p>
          <p>
            — Внедрение лучших практик тестирования для повышения качества
            продукта.
          </p>
          <div>Мои достижения:</div>
          <p>— Организовал работу отдела тестирования.</p>
          <p>— Покрыл автотестами ключевой функционал сайта.</p>
          <p>
            — Настроил запуск автотестов при выкатках в Git Lab CI/CD и настроил
            интеграцию автотестов с TMS Test IT (Теперь можно создавать раны из
            автотестов и отслеживать их выполнение в test it)
          </p>
          <p>— Покрыл весь сайт тест кейсами в Test it.</p>
          <p>— На все дефекты заведены баг репорты.</p>
          <div>Используемый стэк технологий:</div>
          <p>
            Node.js, React, Mongo DB, JavaScript, PHP, Laravel, HTML, CSS, SASS,
            Bootstrap, BAM, XML, JSON, Vue.js, yii, Cypress, jUnit, PostgreSQL
          </p>
        </div>
      </div>
      <div className="career-1">
        <div className="career-1-text">
          <img
            className="career-1-img"
            src="https://fstravel.com/storage/images/logo.svg"
            alt="Описание изображения"
          ></img>
          <h3 className="career-1-h3">АО Северсталь инфоком</h3>
          <div>
            <b>Москва</b>
          </div>
          <div>Тестировщик ПО</div>
          <div>Апрель 2022 — Апрель 2023 (1 год и 1 месяц)</div>
          <p>
            Работа в команде из 75 человек над несколькими IT-проектами, такими
            как FUN SUN, Крым, Аэрофлот, внутренние разработки Северстали и
            ведущего турагентства России Fun & Sun (ранее TUI).
          </p>
          <div>Мои обязанности:</div>
          <br></br>
          <div>Ручное тестирование</div>
          <p>— Функциональное тестирование веб-приложений.</p>
          <p>— Дымовое тестирование (smoke testing).</p>
          <p>— Регрессионное тестирование.</p>
          <p>— Приёмочное тестирование.</p>
          <p>— Тестирование локализации и интернационализации.</p>
          <p>— Интеграционное тестирование.</p>
          <p>
            — Кросс-браузерное и кросс-платформенное тестирование с
            использованием BrowserStack.
          </p>
          <p>— UI/UX тестирование.</p>
          <p>— Нагрузочное тестирование с использованием JMeter.</p>
          <p>— Тестирование мобильных приложений (2 приложения).</p>
          <p>— Контрольная проверка задач перед релизом.</p>
          <div>Автоматизированное тестирование</div>
          <p>— Автоматизация API с использованием Postman.</p>
          <p>— Автоматизация тестирования с использованием Cypress.</p>
          <div>Дополнительные обязанности:</div>
          <p>
            — Менторство младших специалистов (введение в работу, адаптация,
            обучение, контроль).
          </p>
          <p>— Замещение QA lead в его отсутствие.</p>
          <p>— Проведение собраний и обучений.</p>
          <p>— Проведение собеседований.</p>
          <p>— Составление и актуализация тест-кейсов в TestRail.</p>
          <p>— Описание инструкций в Confluence.</p>
          <p>— Заведение багов и задач в Jira.</p>
          <p>
            — Распределение задач в команде и отслеживание их выполнения в Jira.
          </p>
          <p>
            — Общение с разработчиками и аналитиками в процессе выполнения
            задач.
          </p>
          <p>
            — Составление отчетов и рекомендаций по улучшению показателей
            скорости загрузки веб-приложений в Lighthouse.
          </p>
          <div>Мои достижения:</div>
          <p>
            — Получил бесценный опыт, наблюдая за развитием команды с самого
            начала.
          </p>
          <p>— Покрыл автотестами ключевой функционал сайта.</p>
          <p>
            — Активно участвовал в развитии проекта и наблюдал результаты своих
            усилий.
          </p>
          <p>
            — Помогал формировать и обучать высококвалифицированную команду
            тестировщиков.
          </p>
          <p>
            — Внедрил тестирование back-end и задокументировал его в Confluence.
          </p>
          <p>
            — Автоматизировал тестирование API и создал документацию в
            Confluence.
          </p>
          <p>
            — Внедрил программу BrowserStack для кросс-браузерного и
            кросс-платформенного тестирования.
          </p>
          <p>
            — Закрыл автотестами более 50% веб-приложений с использованием
            Cypress.
          </p>
          <div>Другие достижения:</div>
          <p>
            — При моем вступлении в команду backlog составлял более 3000 задач.
            На данный момент количество задач сократилось до менее 200 и они
            распределены на ближайшие 2 релиза.
          </p>
          <p>— Мы перешли на ежедневные релизы.</p>
          <p>— В отсутствие Team Lead QA я замещаю его должность.</p>
          <p>— Я хорошо знаком со всем процессом работы отдела.</p>
          <p>
            — Умею настраивать дашборды для контроля всех процессов,
            распределять задачи между коллегами, устанавливать приоритеты,
            проводить собрания и обучения.
          </p>
          <p>— Я отвечаю за контрольную проверку всех задач перед релизом.</p>
          <div>Используемый стэк технологий:</div>
          <p>
            Node.js, React, Microsoft SQL, JavaScript, C#, .NET, PHP, Laravel,
            HTML, CSS, XML, JSON, Vue.js, PostgreSQL, Git, Bootstrap.
          </p>
        </div>
      </div>
      <div className="career-1">
        <div className="career-1-text">
          <img
            className="career-1-img"
            src="https://yastatic.net/s3/web4static/_/v2/Qp8JE5cCGPNSoggwwYVrvTp_6ds.svg"
            alt="Описание изображения"
          ></img>
          <h3 className="career-1-h3">Яндекс (Анкор)</h3>
          <div>
            <b>Москва</b>
          </div>
          <div>Младший специалист ручного тестирования</div>
          <div>Ноябрь 2021 — Апрель 2022 (6 месяцев)</div>
          <br></br>
          <br></br>
          <br></br>
          <br></br>
          <br></br>
          <div>Мои обязанности:</div>
          <p>— Функциональное тестирование веб и мобильных приложений.</p>
          <p>— Регрессионное тестирование</p>
          <p>— Составление отчетов о тестировании</p>
          <p>— Выполнение тест-кейсов</p> <p>— Заведение баг-репортов</p>
          <div>Я принимал участие в тестировании:</div>
          <p>
            Яндекс Дзен, Яндекс Кью, Яндекс Игры, приложения Яндекс Почта,
            Яндекс Диск как веб так и для мобильных устройств. Так же тестировал
            будущие сервисы.
          </p>
          <div>Мои достижения:</div>
          <p>
            — Укрепил знания в области тестирование веб и мобильных приложений
          </p>
          <p>
            — Получил практический опыт в заведении баг репортов и составлении
            отчетов о тестировании
          </p>
        </div>
      </div>
      <div className="career-1">
        <div className="career-1-text">
          <img
            className="career-1-img"
            src="https://en.chessbase.com/images/cb-logo.svg"
            alt="Описание изображения"
          ></img>
          <h3 className="career-1-h3">ООО "Чессбэйс"</h3>
          <div>
            <b>Москва</b>
          </div>
          <div>Генеральный директор</div>
          <div>Апрель 2019 — Август 2020 (1 год и 5 месяцев)</div>
          <br></br>
          <div>Мои обязанности:</div>
          <p>— Организация и оптимизация всех бизнес-процессов с нуля.</p>
          <p>
            — Оформление всех необходимых юридических документов для законного
            функционирования компании.
          </p>
          <p>
            — Активное участие в подборе и найме квалифицированных сотрудников.
          </p>
          <p>
            — Разработка и установление эффективной командной структуры, включая
            разработчиков, дизайнеров, маркетологов и других специалистов.
          </p>
          <p>
            — Поиск и установление партнерских отношений для развития и
            расширения бизнеса.
          </p>
          <p>
            — Участие в крупных шахматных турнирах в качестве представителя
            нашей компании и продвижение наших продуктов перед широкой
            аудиторией.
          </p>
          <div>Резюмирую:</div>
          <p>
            Я с нуля создал и успешно развил проект, который в 2020 году передал
            в управление и на данный момент не имею никакого юридического и
            финансового отношения.
          </p>
        </div>
      </div>
    </div>
  );
}

export default Career;
